Revit 2027 API
Curve.IsInside Method
Indicates whether the specified parameter value is within this curve's bounds.
Overload List
Name | Description
IsInside(Double) | Indicates whether the specified parameter value is within this curve's bounds.
IsInside(Double, Int32) | Indicates whether the specified parameter value is within this curve's bounds and outputs the end index.
Top
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace